# NOTE: this file is read by freshen-apt script

# Applications

bless
inkscape

# Developer tools

build-essential
git-all
hub
nodejs
pipx
python3-livereload
python3-pip
shellcheck
teensy-loader-cli

# System management

cryptsetup
synaptic

# Gnome Themes

arc-theme

# General utilities

curl
feh
ffmpeg
gist
gnome-control-center
groff
htop
httpie
inotify-tools
iotop
lm-sensors
mc
mesa-utils
net-tools
pigz
pm-utils
powertop
redshift
ripgrep
rxvt-unicode
slock
sshfs
tmux
unzip
webcamoid
xfconf

# Used by emacs config

emacs-gtk
fonts-hack

# Used by roam-backup script

firefox
libsecret-tools

# Deps of keynav

libcairo2-dev
libxdo-dev
libxinerama-dev

# Used by env / xmonad

byzanz
scrot
ccze

# Deps of xmonad

libx11-dev
libxft-dev
libxinerama-dev
libxrandr-dev
libxss-dev

# Deps of git-credential-libsecret

libsecret-1-0
libsecret-1-dev

# Deps of building alacritty

cmake
pkg-config
libfreetype6-dev
libfontconfig1-dev
libxcb-xfixes0-dev
libxkbcommon-dev python3

# Deps of building darkman

golang
scdoc

# Other build deps

libssl-dev
