# NOTE: this file is read by freshen-apt script

# Applications

gimp
inkscape

# Developer tools

autoconf
build-essential
direnv
git-all
gource
heaptrack
heaptrack-gui
hub
neovim
nodejs
npm
pipx
python3-livereload
python3-pip
shellcheck
teensy-loader-cli

# System management

nvidia-settings
cryptsetup
gparted
synaptic

# Gnome Themes

arc-theme

# General utilities

curl
entr
feh
ffmpeg
flatpak
gist
gnome-control-center
graphviz
groff
htop
httpie
inotify-tools
iotop
libfuse2
lm-sensors
mc
mesa-utils
meson
net-tools
nvidia-prime
nvtop
obs-studio
pavucontrol
pigz
pm-utils
powertop
ranger
redshift
ripgrep
slock
sshfs
texlive-latex-base
texlive-latex-extra
texlive-latex-recommended
tmux
unzip
webcamoid
xdotool
xclip
xfconf

# Used by emacs config

emacs-gtk
fonts-hack

# Deps of keynav

libcairo2-dev
libxdo-dev
libxinerama-dev

# Used by env / xmonad

byzanz
ccze
maim
scrot
tesseract-ocr

# Deps of xmonad

libx11-dev
libxft-dev
libxinerama-dev
libxrandr-dev
libxss-dev

# Deps of git-credential-libsecret

libsecret-1-0
libsecret-1-dev

# Deps of building alacritty

cmake
pkg-config
libfreetype6-dev
libfontconfig1-dev
libxcb-xfixes0-dev
libxkbcommon-dev python3

# Deps of dunst

libdbus-1-dev
libgdk-pixbuf-2.0-dev
libpango1.0-dev

# Deps of building darkman

golang
scdoc

# Deps of building zed

libasound2-dev
libxkbcommon-x11-dev

# Other build deps

libssl-dev
