# NOTE: this file is read by freshen-apt script

# Applications

spotify-client
gimp
inkscape
simplescreenrecorder

# Developer tools

alacritty
autoconf
build-essential
direnv
git-all
git-lfs
gource
heaptrack
heaptrack-gui
hub
pipx
ruby-foreman
shellcheck
teensy-loader-cli

# System management

cryptsetup
gparted
synaptic
lm-sensors

# Gnome Themes

arc-theme

# General utilities

rclone
pandoc
apt-file
curl
entr
exiftool
feh
ffmpeg
flameshot
flatpak
gedit
gist
gnome-control-center
graphviz
groff
htop
httpie
inotify-tools
iotop
libnotify-bin
lm-sensors
mc
mesa-utils
meson
net-tools
network-manager-tui
obs-studio
ocrmypdf
pavucontrol
pigz
pm-utils
powertop
qpdf
ranger
redshift
ripgrep
rsync
slock
sshfs
texlive-latex-base
texlive-latex-extra
texlive-latex-recommended
texlive-xetex
tmux
tuned
unzip
xclip
xdotool
xfconf

# Docker

podman
qemu-system-gui
qemu-system-x86
qemu-utils

# Python

python3
python3-livereload
python3-pip
python3-seaborn
python3-matplotlib
python3-pandas

# Used by emacs config

emacs-gtk
fonts-hack

# Deps of keynav

libcairo2-dev
libxdo-dev
libxinerama-dev

# Used by env / xmonad

byzanz
ccze
maim
scrot
tesseract-ocr

# Deps of xmonad

libgmp-dev
libx11-dev
libxft-dev
libxinerama-dev
libxrandr-dev
libxss-dev

# Deps of git-credential-libsecret

libsecret-1-0
libsecret-1-dev

# Deps of building alacritty

cmake
pkg-config
libfreetype6-dev
libfontconfig1-dev
libxcb-xfixes0-dev
libxkbcommon-dev

# Deps of dunst

libdbus-1-dev
libgdk-pixbuf-2.0-dev
libpango1.0-dev

# Deps of building darkman

golang
scdoc

# Deps of ghostty

blueprint-compiler
gcc-multilib
gettext
gettext
libadwaita-1-dev
libgtk-4-dev
libgtk4-layer-shell-dev
libxml2-utils

# Other build deps

libssl-dev
